In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
# Konversi nilai numerik ke dalam sejumlah kategori

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0     6
1    54
2    23
3    75
4    91
5     6
6    27
7    86
8    85
9    89

In [4]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0     6          anak
1    54        dewasa
2    23        dewasa
3    75        manula
4    91        manula
5     6          anak
6    27        dewasa
7    86        manula
8    85        manula
9    89        manula

In [5]:
# Menggabungkan (merge) dua Data Frame

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  11  13  10  10  16
1  18  13   1   9  19
2  19   5   5  16  10
3   4  13   4   5  17
4  18  18   6  11   1

In [7]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0  11  13  10  10  16
2  19   5   5  16  10
3   4  13   4   5  17

In [8]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B  C   D   E
1  18  13  1   9  19
2  19   5  5  16  10
4  18  18  6  11   1

In [9]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B  C   D   E
0  19  5  5  16  10

In [10]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   4  13   4   5  17
1  11  13  10  10  16
2  18  13   1   9  19
3  18  18   6  11   1
4  19   5   5  16  10

In [11]:
# Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

In [12]:
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'], 
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

In [13]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [14]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

In [16]:
# Menata ulang Data Frame dengan mutiple indexes menggunakan unstack()

In [20]:
df = pd.read_csv('titanicfull.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [22]:
df.groupby(['Sex', 'Pclass'])['Survived'].mean().to_frame()

               Survived
Sex    Pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [24]:
df.groupby(['Sex', 'Pclass'])['Survived'].mean().unstack()

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447